#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/concerthub/concerthub-workspace/runs/run-acUnYfJ7qWZF7VmA

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "CHResourceGroup"
    }

  # module.web_app_container.data.azurerm_client_config.main will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_client_config" "main"  {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.web_app_container.data.azurerm_resource_group.main will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_resource_group" "main"  {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "CHResourceGroup"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.web_app_container.azurerm_app_service.main will be created
  + resource "azurerm_app_service" "main" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = {
          + "DOCKER_REGISTRY_SERVER_URL"          = "https://index.docker.io"
          + "WEBSITES_CONTAINER_START_TIME_LIMIT" = "600"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE" = "false"
        }
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = (known after apply)
      + name                              = "concertHubApp"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "CHResourceGroup"
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = false
          + always_on                            = true
          + dotnet_framework_version             = "v4.0"
          + ftps_state                           = "Disabled"
          + http2_enabled                        = false
          + ip_restriction                       = []
          + linux_fx_version                     = "COMPOSE|dmVyc2lvbjogIjMuNyIKCnNlcnZpY2VzOgogIGFwcDoKICAgIGJ1aWxkOiAuL2FwcAogICAgaW1hZ2U6IHNhbWRhbHZhaS9jb25jZXJ0aHViX2FwcDoxLjEKICAgICMgdW5jb21tZW50IHRoaXMgbGluZSB0byBzdGFydCBhIGxvY2FsIGRldmVsb3BtZW50IGVudmlyb25tZW50CiAgICAjdm9sdW1lczoKICAgICAjIC0gLi9hcHA6L3Zhci93d3cvaHRtbC8KICAgIGRlcGVuZHNfb246CiAgICAgIC0gbXlzcWwKICAgIHBvcnRzOgogICAgICAtIDgwODA6ODAKICAgIHJlc3RhcnQ6IG9uLWZhaWx1cmUKICAgIGVudmlyb25tZW50OgogICAgICBNWVNRTF9IT1NUOiBteXNxbAogICAgICBNWVNRTF9VU0VSOiByb290CiAgICAgIE1ZU1FMX1BBU1NXT1JEOiByb2NrCiAgICAgIE1ZU1FMX0RCOiBjb25jZXJ0REIKCiAgbXlzcWw6CiAgICBidWlsZDogLi9kYgogICAgaW1hZ2U6IHNhbWRhbHZhaS9jb25jZXJ0aHViX215c3FsOjEuMAogICAgdm9sdW1lczoKICAgICAgLSBteXNxbC1kYXRhOi92YXIvbGliL215c3FsCiAgICByZXN0YXJ0OiBvbi1mYWlsdXJlCiAgICBlbnZpcm9ubWVudDoKICAgICAgTVlTUUxfUk9PVF9QQVNTV09SRDogcm9jawogICAgICBNWVNRTF9EQVRBQkFTRTogY29uY2VydERCCgogIHB5dGhvbjoKICAgIGJ1aWxkOiAuL3B5dGhvbgogICAgaW1hZ2U6IHNhbWRhbHZhaS9jb25jZXJ0aHViX3B5dGhvbjoxLjAKICAgIGRlcGVuZHNfb246CiAgICAgIC0gbXlzcWwKICAgIHJlc3RhcnQ6IG9uLWZhaWx1cmUKICAgIGVudHJ5cG9pbnQ6IHB5dGhvbiAtdSBweXRob24vc2NoZWR1bGVkam9icy5weQoKdm9sdW1lczoKICBteXNxbC1kYXRhOg=="
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + remote_debugging_enabled             = false
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = (known after apply)
          + scm_use_main_ip_restriction          = false
          + use_32_bit_worker_process            = false
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.web_app_container.azurerm_app_service_plan.main[0] will be created
  + resource "azurerm_app_service_plan" "main" {
      + id                           = (known after apply)
      + kind                         = "linux"
      + location                     = (known after apply)
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "CHServicePlan"
      + reserved                     = true
      + resource_group_name          = "CHResourceGroup"

      + sku {
          + capacity = (known after apply)
          + size     = "B1"
          + tier     = "Basic"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @samdalvai, Action: `pull_request`*